greeting = 
    🌊 <b>Добро пожаловать в Flowbit Bot!</b>
    Ваше торговое путешествие проходит без усилий с нами!

    🔑 Давайте начнем с создания или импорта вашего кошелька

profileMessage =
    🌊 <b>Добро пожаловать в Flowbit</b>
    Пусть ваше торговое путешествие проходит легко с нами!

    🌟 <b>Адрес вашего Solana кошелька:</b>
    { $walletsText }

    🕒 Последнее обновление: { $lastUpdated }

errorWhileFetchingUserData = **Упс!** Мы не смогли загрузить ваши данные. Пожалуйста, попробуйте снова позже.

enterPrivateKey = 🔑 Введите ваш приватный ключ:

settingsMessage = 
    🌊 <b>Настройки Flowbit</b>

    ✨ Узнать больше: <a href="https://flowbit.io">здесь</a>

    🕒 Последнее обновление: { $lastUpdated }

languageMessage = 
    🌊 <b>Настройки языка</b>
    
    <b>Ваш текущий язык:</b> { $currentLanguage }
    
    <b>Доступные языки:</b>

walletCreated = 
    🟢 <b>Ваш кошелек успешно создан</b>
    ⚠️ <i>Пожалуйста, храните его в безопасности и не делитесь с кем-либо. После того как это сообщение будет удалено, вы не сможете восстановить ваш приватный ключ.</i>

    🔑 <b>Приватный ключ:</b>
    <code>{ $privateKey }</code>

    👛 <b>Ваши адреса Solana кошелька:</b>
    <code>{ $publicKey }</code>
    
    Для начала торговли, пожалуйста, внесите SOL на ваш адрес. 
    Вносите SOL только через сеть SOL.

walletImported = 
    🟢 <b>Ваш кошелек успешно импортирован</b>
    ⚠️ <i>Пожалуйста, храните его в безопасности и не делитесь с кем-либо. После того как это сообщение будет удалено, вы не сможете восстановить ваш приватный ключ.</i>

    🔑 <b>Приватный ключ:</b>
    <code>{ $privateKey }</code>

    👛 <b>Ваши адреса Solana кошелька:</b>
    <code>{ $publicKey }</code>
    
    Для начала торговли, пожалуйста, внесите SOL на ваш адрес. 
    Вносите SOL только через сеть SOL.

invalidPrivateKey =  ❌ <b>Неверный формат приватного ключа.</b> Пожалуйста, введите действительный приватный ключ Solana.

importWallet = 📥 Импортировать кошелек

createWallet = 🆕 Создать кошелек

startTrading = 🚀 Начать торговлю

settings = ⚙️ Настройки

refresh = 🔄 Обновить

close = 🚫 Закрыть

balance = ˪💰 <b>Баланс</b>

language = 🌐 Язык

back = ◀️ Назад

wallets = 👛 Кошельки

walletsSettings = 
    🌊 <b>Настройки кошельков</b>
    Управляйте всеми своими кошельками без усилий.

    ✨ Узнать больше: <a href="https://flowbit.io">здесь</a>

    🕒 Последнее обновление: { $lastUpdated }

importWalletSettings = 
    🟢 <b>Ваш кошелек успешно импортирован</b>
    ⚠️ <i>Пожалуйста, храните его в безопасности и не делитесь с кем-либо. После того как это сообщение будет удалено, вы не сможете восстановить ваш приватный ключ.</i>

    🔑 <b>Приватный ключ:</b>
    <code>{ $privateKey }</code>

    👛 <b>Ваши адреса Solana кошелька:</b>
    <code>{ $publicKey }</code>

    🕒 Последнее обновление: { $lastUpdated }

createWalletSettings = 
    🟢 <b>Ваш кошелек успешно создан</b>
    ⚠️ <i>Пожалуйста, храните его в безопасности и не делитесь с кем-либо. После того как это сообщение будет удалено, вы не сможете восстановить ваш приватный ключ.</i>

    🔑 <b>Приватный ключ:</b>
    <code>{ $privateKey }</code>

    👛 <b>Ваши адреса Solana кошелька:</b>
    <code>{ $publicKey }</code>

    🕒 Последнее обновление: { $lastUpdated }

walletAlreadyExists = ⚠️ <b>Этот кошелек уже связан с вашим аккаунтом.</b>

walletPage = 
    🌊 <b>Адрес вашего Solana кошелька:</b>

    → { $walletName }: <code>{ $walletAddress }</code>
    ˪💰 Баланс: { $balance } SOL (~USD { $usdBalance })

    { $isDefaultWallet } Default Wallet

    🕒 Последнее обновление: { $lastUpdated }

renameWallet = ✏️ Переименовать кошелек

deleteWallet = 🗑️ Удалить кошелек

enterNewWalletName = 🌊 <b>Введите новое имя для кошелька:</b>

walletRenamed = 🌊 <b>Кошелек переименован в:</b> { $walletName }

walletDeleted = 🗑️ <b>Кошелек удален</b>

deleteWalletConfirmation = ⚠️ <b>Вы уверены, что хотите удалить этот кошелек?</b>

deleteWalletConfirmationYes = ✅ Да

deleteWalletConfirmationNo = ❌ Нет

ruLanguage = 🇷🇺 Русский

enLanguage = 🇺🇸 Английский

languageUpdated = 🌐 Язык обновлен

manualBuyer = 🛒 Ручная покупка

defaultWallet = Основной кошелек

walletSetAsDefault = ✅ Кошелек установлен как основной